
// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)

// 2, 4 -> 16
// Console.WriteLine("введите число A");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("введите число B");
// int b = Convert.ToInt32(Console.ReadLine());
// int fact = a;

// for (int i = 1; i < b; i++)
// {
// fact = fact * a;
// }
// Console.WriteLine("A в степени B равно: " + fact);

// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

// 452 -> 11

// 82 -> 10

// 9012 -> 12

// Console.WriteLine ("Введите число А: ");
// int a = Convert.ToInt32(Console.ReadLine());
// int sum = 0;

// while ( a>0 )
// {
//     int num = a % 10;
//     a = a / 10;
//     sum= sum + num;
// }
// Console.WriteLine("Сумма всех цифр в числе равна:" +sum);
 
//  Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран. Вывод сделать отдельным методом.